app/controllers/restaurants_controller.rb

SELECT `restaurants`.* FROM `restaurants`
---
  def index
  	@restaurants = Restaurant.all

SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 1 LIMIT 1
---
  def show
   @restaurant = Restaurant.find(params[:id])

SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 1 LIMIT 1
---
  def edit
    @restaurant = Restaurant.find(params[:id])

INSERT INTO `restaurants` (`address`, `city`, `created_at`, `description`, `image`, `name`, `owner_id`, `phone`, `state`, `updated_at`) VALUES ('105 Drake Street', 'Malverne', '2013-11-15 19:09:23', 'Good burgers', 'fI9aRE3.jpg', 'Bob\'s Burgers', 1, '5169671237', 'New York', '2013-11-15 19:09:23')
---
  def create
  	@restaurant = Restaurant.new(params[:restaurant].permit(:name, :description, :address, :phone, :image))

    if @restaurant.save

SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 14 LIMIT 1
UPDATE `restaurants` SET `name` = 'More Pancakes Please...', `description` = 'Stacks of the most delicious pancakes in the city; served just the way you like it.', `address` = '411 E Pancake Avenue', `phone` = '1800pancakes', `city` = 'New York', `state` = 'NY', `updated_at` = '2013-11-24 17:19:27' WHERE `restaurants`.`id` = 20
---
  def update
    @restaurant = Restaurant.find(params[:id])

    if @restaurant.update_attributes(params[:restaurant].permit(:name, :description, :address, :phone, :image))

SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 7 LIMIT 1
DELETE FROM `restaurants` WHERE `restaurants`.`id` = 7
---
  def destroy
    @restaurant = Restaurant.find(params[:id])
    @restaurant.destroy